In [88]:
import pandas as pd

## <span style="color:Brown"> **Lab5 -- `pandas.Dataframe`** </span>

 **1.	(1pt) Create a dataframe that looks like the following.** 
 
 <img src="df1.png" align="middle" style="width:200px;height:160px;"/>

In [91]:
d = {'name' : ['Alice', 'Tom', 'John', 'Kevin', 'Emma', 'Ethan'], 
     'instrument' : ['piano', 'guitar', 'Saxophone', 'drum', 'clarinet', 'electric guitar']}
df = pd.DataFrame(d)
df

    name       instrument
0  Alice            piano
1    Tom           guitar
2   John        Saxophone
3  Kevin             drum
4   Emma         clarinet
5  Ethan  electric guitar

 **2.	(1 pt) show names of all columns.**

In [93]:
df.columns

Index(['name', 'instrument'], dtype='object')

**3.	(1 pt) Create a dataframe that looks like the following. Note the index labels are names.** 

<img src="df2.png" align="middle" style="width:200px;height:160px;"/>

In [95]:
d = {'years' : [3, 5, 2, 4, 2, 3], 
     'instrument' : ['piano', 'guitar', 'Saxophone', 'drum', 'clarinet', 'electric guitar']}
df = pd.DataFrame(d, index=['Alice', 'Tom', 'John', 'Kevin', 'Emma', 'Ethan'])
df

       years       instrument
Alice      3            piano
Tom        5           guitar
John       2        Saxophone
Kevin      4             drum
Emma       2         clarinet
Ethan      3  electric guitar

**4.	(1 pt) Show names of all indices of the dataframe.**

In [97]:
df.index

Index(['Alice', 'Tom', 'John', 'Kevin', 'Emma', 'Ethan'], dtype='object')

**5.	(2 pts) Use `pandas.Dataframe.loc` and  `pandas.Dataframe.iloc`  respectively to show both Alice and Emmaâ€™s information.**

In [99]:
#df.loc[['Alice','Emma'], :]
df.iloc[[0,4],:]

       years instrument
Alice      3      piano
Emma       2   clarinet

**6.	(1 pt) Read `titanic.csv` into a dataframe called `titanicDF` and show the first five rows.**

In [101]:
titanicDF = pd.read_csv('titanic.csv', sep=',')
titanicDF.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**7.	(1 pt) Show the total number of passengers in the dataset.**

In [103]:
titanicDF.shape #(891, 12)
titanicDF.shape[0]

891

**8.	(1 pt) Show the last 5 rows of `titanicDF`.**

In [105]:
#titanicDF.iloc[-5:]
titanicDF.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

**9.	(1 pt) Use `pandas.DataFrame.info()` to determine which columns have missing values. Show those columns' names in a separate markdown cell,using a color of your choice that's not black.**

In [107]:
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

<span style="color:red"> Column "Age" and "Cabin" have missing values. <span>

**10.	(1 pt) Use `pandas.DataFrame.isnull()` and `pandas.DataFrame.sum()` to perform the same task of determining which columns have missing values.**

In [110]:
missing_values = titanicDF.isnull().sum()
missing_values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**11. (1pt) Use `pandas.Dataframe.iloc` to show the `Survived`, `Pclass`, `Name`, `Sex` and `Age` of the first 10 rows of the dataframe.**

In [112]:
result = titanicDF.iloc[:,1:6]
result.head(10)

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0
5,0,3,"Moran, Mr. James",male,NaN
6,0,1,"McCarthy, Mr. Timothy J",male,54.0
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

**12. (1pt) Use `pandas.Dataframe.loc` to perform the same task as described in the above cell.**

In [114]:
result = titanicDF.loc[:, ['Survived', 'Pclass', 'Name', 'Sex', 'Age']]
result.head(10)

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0
5,0,3,"Moran, Mr. James",male,NaN
6,0,1,"McCarthy, Mr. Timothy J",male,54.0
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

**13. (1pt) Use `pandas.Series.unique()` to find all unique values in the `'Pclass'` column. Store the results in a list and display it.**

In [116]:
unique_value = titanicDF.groupby('Pclass').count()
unique_value

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [159]:
titanicDF['Pclass'].unique().tolist()

[3, 1, 2]

**14.	(1 pt) Show the datatype of the column `'Survived'`.**

In [118]:
print(type(titanicDF['Survived'].iloc[0]))

<class 'numpy.int64'>

**15.	(1 pt) Find the number of people who survived and display the results. Hints: Create a filter.**

In [120]:
filter_survived = titanicDF['Survived'] == 1
print("Number of people survivied: ", titanicDF[filter_survived].shape[0])

Number of people survivied:  342

**16.	(1 pt) Use `pandas.Series.value_counts()` to do the same thing in the above cell.**

[https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html)

In [122]:
print(type(titanicDF['Survived'].value_counts()))
print(titanicDF['Survived'].value_counts())
print("Number of people survivied: ",titanicDF['Survived'].value_counts().get(1,0))

<class 'pandas.core.series.Series'>
Survived
0    549
1    342
Name: count, dtype: int64
Number of people survivied:  342

**17.	(1 pt) Find the number of survived females and males respectively and display the results. Hints: create filters.**

In [124]:
filter_survived_male = (titanicDF['Survived'] == 1) & (titanicDF['Sex'] == 'male')
print("Number of male survivied: ", titanicDF[filter_survived_male].shape[0])

Number of male survivied:  109

In [125]:
filter_survived_female = (titanicDF['Survived'] == 1) & (titanicDF['Sex'] == 'female')
print("Number of female survivied: ", titanicDF[filter_survived_female].shape[0])

Number of female survivied:  233

In [126]:
male_survived_count = titanicDF[filter_survived_male].shape[0]
female_survived_count = titanicDF[filter_survived_female].shape[0]

print(male_survived_count + female_survived_count)

342

**18.	(1 pt) Find the number of passengers younger than 18 (children) or older than 60 (seniors) and display the results.**

In [128]:
filter_age = (titanicDF['Age'] < 18) | (titanicDF['Age'] > 60)
print("Number of children and seniors: ", titanicDF[filter_age].shape[0])

Number of children and seniors:  135

**19.	(1 pt) Use `pandas.DataFrame.groupby()` to address the following research question: <br> 
"What is the average ticket fare for passengers who survived compared to those who did not?"**
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [130]:
groupedBySurvived_DF = titanicDF[['Survived','Fare']].groupby('Survived').mean()
groupedBySurvived_DF

               Fare
Survived
0         22.117887
1         48.395408

**20.	(1 pt) Create another research question and address it using the groupby() function.**

**"What is the average age for passengers who survived compared to those who did not?"**

In [133]:
ageBySurvived_DF = titanicDF[['Survived','Age']].groupby('Survived').mean()
ageBySurvived_DF

                Age
Survived
0         30.626179
1         28.343690